'use strict';

module.exports.mockData = [
  {
    id: `U9cyX7`,
    type: `OFFER`,
    title: `Куплю антиквариат.`,
    description: `Если найдёте дешевле — сброшу цену. Не пытайтесь торговаться. Цену вещам я знаю. Кому нужен этот новый телефон, если тут такое... Мой дед не мог её сломать. Если товар не понравится — верну всё до последней копейки.`,
    sum: 4667,
    picture: `item09.jpg`,
    category: [
      `Книги`,
      `Разное`
    ],
    comments: [
      {
        id: `Wc7py5`,
        text: `Вы что?! В магазине дешевле. Оплата наличными или перевод на карту? Неплохо, но дорого.`
      },
      {
        id: `gwL_yr`,
        text: `А сколько игр в комплекте? Совсем немного...`
      },
      {
        id: `P5YcED`,
        text: `Оплата наличными или перевод на карту?`
      }
    ]
  },
  {
    id: `ORNXNO`,
    type: `OFFER`,
    title: `Продам отличную подборку фильмов на VHS.`,
    description: `Если товар не понравится — верну всё до последней копейки. Пользовались бережно и только по большим праздникам., Это настоящая находка для коллекционера!`,
    sum: 57380,
    picture: `item05.jpg`,
    category: [
      `Марки`,
      `Животные`,
      `Посуда`,
      `Книги`,
      `Журналы`,
      `Цветы`
    ],
    comments: [
      {
        id: `vtzzs5`,
        text: `Почему в таком ужасном состоянии? Совсем немного...`
      }
    ]
  },
  {
    id: `HcshRN`,
    type: `OFFER`,
    title: `Отдам в хорошие руки подшивку «Мурзилка».`,
    description: `Две страницы заляпаны свежим кофе. При покупке с меня бесплатная доставка в черте города. Если найдёте дешевле — сброшу цену. Кому нужен этот новый телефон, если тут такое... Таких предложений больше нет!`,
    sum: 49682,
    picture: `item010.jpg`,
    category: [
      `Посуда`,
      `Разное`,
      `Игры`
    ],
    comments: [
      {
        id: `VJithM`,
        text: `Совсем немного... Оплата наличными или перевод на карту? Вы что?! В магазине дешевле.`
      },
      {
        id: `owYHy5`,
        text: `Неплохо, но дорого. Продаю в связи с переездом. Отрываю от сердца. Оплата наличными или перевод на карту?`
      },
      {
        id: `9f94TU`,
        text: `Вы что?! В магазине дешевле. Совсем немного... Неплохо, но дорого.`
      }
    ]
  },
  {
    id: `FTePrA`,
    type: `SALE`,
    title: `Продам советскую посуду. Почти не разбита.`,
    description: `Бонусом отдам все аксессуары.`,
    sum: 48971,
    picture: `item16.jpg`,
    category: [
      `Животные`,
      `Посуда`,
      `Журналы`,
      `Игры`,
      `Марки`,
      `Цветы`
    ],
    comments: [
      {
        id: `KCmscv`,
        text: `Совсем немного... С чем связана продажа? Почему так дешёво?`
      },
      {
        id: `Fz9F8L`,
        text: `А где блок питания? А сколько игр в комплекте? Вы что?! В магазине дешевле.`
      },
      {
        id: `nDEckE`,
        text: `Оплата наличными или перевод на карту? С чем связана продажа? Почему так дешёво? А сколько игр в комплекте?`
      }
    ]
  }
];

module.exports.mockOffer = {
  category: `Котики`,
  title: `Дам погладить котика`,
  description: `Дам погладить котика. Дорого. Не гербалайф`,
  picture: `cat.jpg`,
  type: `OFFER`,
  sum: 100500
};
