'use strict';

module.exports.mockData = [
  {
    id: `K1aM1D`,
    type: `SALE`,
    title: `Куплю породистого кота.`,
    description: `Бонусом отдам все аксессуары. Если найдёте дешевле — сброшу цену. Кажется, что это хрупкая вещь. Мой дед не мог её сломать.`,
    sum: 83497,
    picture: `item13.jpg`,
    category: [
      `Журналы`
    ],
    comments: [
      {
        id: `9HSTm-`,
        text: `Неплохо, но дорого. Оплата наличными или перевод на карту? А сколько игр в комплекте?`
      }
    ]
  },
  {
    id: `_5OzLw`,
    type: `OFFER`,
    title: `Куплю детские санки.`,
    description: `Таких предложений больше нет! При покупке с меня бесплатная доставка в черте города. Бонусом отдам все аксессуары. Не пытайтесь торговаться. Цену вещам я знаю.`,
    sum: 9108,
    picture: `item13.jpg`,
    category: [
      `Игры`,
      `Разное`
    ],
    comments: [
      {
        id: `xk2y__`,
        text: `А где блок питания? Совсем немного...`
      },
      {
        id: `M2jQEk`,
        text: `Продаю в связи с переездом. Отрываю от сердца. Вы что?! В магазине дешевле. А сколько игр в комплекте?`
      },
      {
        id: `swRNdA`,
        text: `А сколько игр в комплекте? Почему в таком ужасном состоянии?`
      }
    ]
  },
  {
    id: `BoIjCr`,
    type: `SALE`,
    title: `Куплю породистого кота.`,
    description: `Мой дед не мог её сломать. Если найдёте дешевле — сброшу цену.`,
    sum: 6659,
    picture: `item12.jpg`,
    category: [
      `Посуда`,
      `Цветы`,
      `Животные`,
      `Марки`,
      `Книги`
    ],
    comments: [
      {
        id: `hMUqNj`,
        text: `С чем связана продажа? Почему так дешёво?`
      },
      {
        id: `NWC8jf`,
        text: `Совсем немного... Неплохо, но дорого. А где блок питания?`
      }
    ]
  }
];
